; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	image1 - mode
	spectrograph8 - mode
	infrared5 - mode
	thermograph3 - mode
	spectrograph6 - mode
	image0 - mode
	spectrograph4 - mode
	image2 - mode
	thermograph9 - mode
	image7 - mode
	Star3 - direction
	GroundStation4 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Star0 - direction
	Star5 - direction
	Planet6 - direction
	Planet7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Phenomenon10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 spectrograph8)
	(supports instrument0 spectrograph4)
	(supports instrument0 image0)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 image2)
	(supports instrument1 spectrograph6)
	(supports instrument1 thermograph3)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet7)
	(supports instrument2 spectrograph8)
	(supports instrument2 image1)
	(supports instrument2 image7)
	(supports instrument2 thermograph9)
	(supports instrument2 infrared5)
	(calibration_target instrument2 Star0)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star8)
)
(:goal (and
	(have_image Star5 spectrograph6)
	(have_image Star5 spectrograph8)
	(have_image Planet6 thermograph9)
	(have_image Planet6 spectrograph4)
	(have_image Planet6 spectrograph6)
	(have_image Planet7 image7)
	(have_image Star8 infrared5)
	(have_image Phenomenon9 thermograph3)
	(have_image Phenomenon9 thermograph9)
	(have_image Phenomenon9 spectrograph6)
	(have_image Phenomenon10 thermograph9)
	(have_image Star11 image1)
))

)

; plan
1. (turn_to satellite1 star0 star8)
   deleted: (pointing satellite1 star8)
   added: (pointing satellite1 star0)
   goals met: 0 of 12
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 12
3. (calibrate satellite1 instrument2 star0)
   added: (calibrated instrument2)
   goals met: 0 of 12
4. (turn_to satellite1 planet6 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 planet6)
   goals met: 0 of 12
5. (take_image satellite1 planet6 instrument2 thermograph9)
   added: (have_image planet6 thermograph9)
   goals met: 1 of 12
6. (turn_to satellite1 phenomenon9 planet6)
   deleted: (pointing satellite1 planet6)
   added: (pointing satellite1 phenomenon9)
   goals met: 1 of 12
7. (take_image satellite1 phenomenon9 instrument2 thermograph9)
   added: (have_image phenomenon9 thermograph9)
   goals met: 2 of 12
8. (turn_to satellite1 phenomenon10 phenomenon9)
   deleted: (pointing satellite1 phenomenon9)
   added: (pointing satellite1 phenomenon10)
   goals met: 2 of 12
9. (turn_to satellite0 groundstation2 planet7)
   deleted: (pointing satellite0 planet7)
   added: (pointing satellite0 groundstation2)
   goals met: 2 of 12
10. (take_image satellite1 phenomenon10 instrument2 thermograph9)
   added: (have_image phenomenon10 thermograph9)
   goals met: 3 of 12
11. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 12
12. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 3 of 12
13. (turn_to satellite0 planet6 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet6)
   goals met: 3 of 12
14. (take_image satellite0 planet6 instrument0 spectrograph4)
   added: (have_image planet6 spectrograph4)
   goals met: 4 of 12
15. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 4 of 12
16. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 4 of 12
17. (turn_to satellite0 groundstation1 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation1)
   goals met: 4 of 12
18. (calibrate satellite0 instrument1 groundstation1)
   added: (calibrated instrument1)
   goals met: 4 of 12
19. (turn_to satellite0 phenomenon9 groundstation1)
   deleted: (pointing satellite0 groundstation1)
   added: (pointing satellite0 phenomenon9)
   goals met: 4 of 12
20. (take_image satellite0 phenomenon9 instrument1 spectrograph6)
   added: (have_image phenomenon9 spectrograph6)
   goals met: 5 of 12
21. (take_image satellite0 phenomenon9 instrument1 thermograph3)
   added: (have_image phenomenon9 thermograph3)
   goals met: 6 of 12
22. (turn_to satellite0 planet6 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 planet6)
   goals met: 6 of 12
23. (take_image satellite0 planet6 instrument1 spectrograph6)
   added: (have_image planet6 spectrograph6)
   goals met: 7 of 12
24. (turn_to satellite0 star5 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star5)
   goals met: 7 of 12
25. (take_image satellite0 star5 instrument1 spectrograph6)
   added: (have_image star5 spectrograph6)
   goals met: 8 of 12
26. (turn_to satellite1 planet7 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 planet7)
   goals met: 8 of 12
27. (take_image satellite1 planet7 instrument2 image7)
   added: (have_image planet7 image7)
   goals met: 9 of 12
28. (turn_to satellite1 star11 planet7)
   deleted: (pointing satellite1 planet7)
   added: (pointing satellite1 star11)
   goals met: 9 of 12
29. (take_image satellite1 star11 instrument2 image1)
   added: (have_image star11 image1)
   goals met: 10 of 12
30. (turn_to satellite1 star5 star11)
   deleted: (pointing satellite1 star11)
   added: (pointing satellite1 star5)
   goals met: 10 of 12
31. (take_image satellite1 star5 instrument2 spectrograph8)
   added: (have_image star5 spectrograph8)
   goals met: 11 of 12
32. (turn_to satellite1 star8 star5)
   deleted: (pointing satellite1 star5)
   added: (pointing satellite1 star8)
   goals met: 11 of 12
33. (take_image satellite1 star8 instrument2 infrared5)
   added: (have_image star8 infrared5)
   goals met: 12 of 12
